# N X N크기의 농장이 있다.

# 이 농장에는 이상한 규칙이 있다.

# 규칙은 다음과 같다.


#    ① 농장은 크기는 항상 홀수이다. (1 X 1, 3 X 3 … 49 X 49)
#    ② 수확은 항상 농장의 크기에 딱 맞는 정사각형 마름모 형태로만 가능하다.

# 1 X 1크기의 농장에서 자라는 농작물을 수확하여 얻을 수 있는 수익은 3이다.
# 3 X 3크기의 농장에서 자라는 농작물을 수확하여 얻을 수 있는 수익은 16 (3 + 2 + 5 + 4 + 2)이다.
# 5 X 5크기의 농장에서 자라는 농작물의 수확하여 얻을 수 있는 수익은 25 (3 + 2 + 1 + 1 + 2 + 5 + 1 + 1 + 3 + 3 + 2 + 1)이다.
# 농장의 크기 N와 농작물의 가치가 주어질 때, 규칙에 따라 얻을 수 있는 수익은 얼마인지 구하여라.


# [제약 사항]
# 농장의 크기 N은 1 이상 49 이하의 홀수이다. (1 ≤ N ≤ 49)
# 농작물의 가치는 0~5이다.


# [입력]
# 가장 첫 줄에는 테스트 케이스의 개수 T가 주어지고, 그 아래로 각 테스트 케이스가 주어진다.
# 각 테스트 케이스에는 농장의 크기 N과 농장 내 농작물의 가치가 주어진다.


# [출력]
# 각 줄은 '#t'로 시작하고, 공백으로 농장의 규칙에 따라 얻을 수 있는 수익을 출력한다.
# (t는 테스트 케이스의 번호를 의미하며 1부터 시작한다.)

# 일단 생각을 해보자. 알고리즘은 항상 반복문을 사용해야한다.
# 농장 크기에 맞는 마름모 형태의 값을 다 더해야한다.
# 그럼 마름모 형태에 있는 값을 반복문으로 찾아서 변수에 넣어서 누적합을 하면 되는거 아닌가?
# 근데 마름모 형태를 어떻게 더하지? 구하지?
# 일단 맷 첫줄은 무조건 중간값이다
# 그리고 두번째 줄은 중간값에서 -1, +1 한 자리 아닌가?
# 근데 그럼 세로 범위는 또 어떻게 정해야하지
# 가로 한줄이 다 수확될 부분은 세로의 중앙값임.
# 그럼 반복문으로 찾아야 하는건 뭘까


# 일단 필요한 변수 : total (누적합 할 변수 total = 0), 

# N = 5
#            열 (c)
#         0 1 2 3 4

# 행 0        O        -> 2 ~ 2 ############# start : 2 end : 2
# 행 1      O O O      -> 1 ~ 3 ############# start : 1 end : 3
# 행 2    O O O O O    -> 0 ~ 4 #############  여기를 기준으로 
# 행 3      O O O      -> 1 ~ 3 ############# start : 2 end : 2
# 행 4        O        -> 2 ~ 2 ############# start : 1 end : 3

import sys
sys.stdin = open('input.txt')

T = int(input())
for tc in range(1, T + 1):

    N  = int(input()) # 농장의 크기. 예를 들면 5면 5*5라는거임

    farm = []

    for _ in range(N):
        row = list(map(int, input()))
        farm.append(row) # 만든 행을 farm에 넣음

    # print(farm)
    total = 0

    center = N // 2 
    # 이거는 행이나 열에서 항상 중간값임 이걸 기준으로 위 아래 나눠서 봐야댐
    # 그럼, 기준 행과 열을 찾았으니까 반복문으로 각 행부터 내려와야하는거아님?
    # 열의 범위는 center에 다다를 때 까지 start는 줄어들고 end는 늘어난다
    
    start = center # 기준값을 두는 것임. 
    end = center

    for r in range(N): # 일단 모든 행 보셈
        for c in range(start, end + 1): # 그 행에서 start부터 end까지 보겟슨
            total = total + farm[r][c] # 그 값을 total에 더하겟슨

            # start = start - 1
            # end = end + 1

        if r < center: 
            start = start - 1
            end = end + 1
        else:
            start = start + 1
            end = end - 1
        # 가운데 행 까지 넓히고 가운데 행을 지나면 좁힌다
        # 쒜에에엣

    print(f'#{tc} {total}')


 

