# N X N크기의 농장이 있다.
# 이 농장에는 이상한 규칙이 있다.
# 규칙은 다음과 같다.

#    ① 농장은 크기는 항상 홀수이다. (1 X 1, 3 X 3 … 49 X 49)
#    ② 수확은 항상 농장의 크기에 딱 맞는 정사각형 마름모 형태로만 가능하다.
# 1 X 1크기의 농장에서 자라는 농작물을 수확하여 얻을 수 있는 수익은 3이다.
# 3 X 3크기의 농장에서 자라는 농작물을 수확하여 얻을 수 있는 수익은 16 (3 + 2 + 5 + 4 + 2)이다.
# 5 X 5크기의 농장에서 자라는 농작물의 수확하여 얻을 수 있는 수익은 25 (3 + 2 + 1 + 1 + 2 + 5 + 1 + 1 + 3 + 3 + 2 + 1)이다.
# 농장의 크기 N와 농작물의 가치가 주어질 때, 규칙에 따라 얻을 수 있는 수익은 얼마인지 구하여라.

# [제약 사항]
# 농장의 크기 N은 1 이상 49 이하의 홀수이다. (1 ≤ N ≤ 49)
# 농작물의 가치는 0~5이다.

# [입력]
# 가장 첫 줄에는 테스트 케이스의 개수 T가 주어지고, 그 아래로 각 테스트 케이스가 주어진다.
# 각 테스트 케이스에는 농장의 크기 N과 농장 내 농작물의 가치가 주어진다.

# [출력]
# 각 줄은 '#t'로 시작하고, 공백으로 농장의 규칙에 따라 얻을 수 있는 수익을 출력한다.
# (t는 테스트 케이스의 번호를 의미하며 1부터 시작한다.)

# 일단 리스트를 하나 만든다
# 우리는 지금 리스트에 마름모 구역의 숫자를 넣어서, 그것의 총 합을 구해야함
# 그러면 우리가 마름모 구역을 어떻게 구하는가
# 절대값을 구할줄 알면 쉬운데 다는 못함
# 그러면 일단 중심점을 잡아야함
# r의 첫줄(가로)는 무조건 가운데 점이 중심이됨 -> 이건 N // 2
# 그럼 일단 알고리즘은 항상 반복문을 쓴다
# 그럼 뭘 반복해야할까?
# 첫줄부터 양 옆으로 +1, +2, +3 이렇게 증가하다가 N의 값이 똑같아 질 때 다시 줄어듬



import sys
sys.stdin = open('input.txt')

T = int(input())
for tc in range(1, T + 1):

    N = int(input()) # 이게 N*N 크기를 나타냄
    farm = [] # 리스트를 하나 만들었음

    # 첫줄 가운데 구역은 항상 N // 2 그럼 가운데 구역을 M이라고 둿을때
    # M = N // 2

    # 그럼 row한줄한줄 돌면서 구역에 맞는 방향인지를확인해야댐 -> 반복문
    for _ in range(N):
        row = list(map(int,input()))
        farm.append(row)
        # print(farm)

        total = 0 ###############메모 : 이거 설정을 안함

        center = N // 2 # 나는 일단 row를 기준으로 한줄한줄 볼거임 그래서 이게 r[0]의 첫 구역임

        start = center
        end = center #난 row를 한줄한줄 볼거니까 일단 첫줄 끝줄 기준점을 잡아야댐

        ###################################################################################3
        for r in range(N):
            for c in range(start, end + 1):
                    



